cask_args appdir: '/Applications'


# フォーミュラの追加
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/php'
tap 'homebrew/dupes'
tap 'cloudfoundry/tap'


# パッケージのインストール
# Git・シェル
brew 'git'
brew 'git-flow'
brew 'zsh'
brew 'zsh-completions'

# パッケージマネージャ
brew 'mas'
brew 'nodebrew'
brew 'rbenv'
brew 'ruby-build'
brew 'direnv'

# ライブラリ
brew 'autoconf'
brew 'ffmpeg'
brew 'libiconv'
brew 'libxml2'
brew 'libxslt'
brew 'openssl'
# brew 'openssh', args: ['with-brewed-openssl', 'with-keychain-support']
brew 'pkg-config'
brew 'imagemagick'
brew 'sox'

# ミドルウェア
brew 'mysql', restart_service: true
brew 'php55'
brew 'postgresql', restart_service: true
brew 'wp-cli'

# Vim
brew 'vim', args: ['with-lua']

# その他
brew 'tree'
brew 'heroku'
brew 'cf-cli'


# MacAppのインストール
# ブラウザ
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox-ja'
cask 'opera'

# ターミナルエミュレータ・エディタ
cask 'iterm2'
cask 'macdown'
cask 'atom'
cask 'processing'

# クラウドサービス
cask 'dropbox'
cask 'google-drive'

# ユーティリティ
cask 'google-japanese-ime'
cask 'alfred'
cask 'appcleaner'
cask 'bettertouchtool'
# cask 'steermouse' #v4を手動インストールしたい
cask 'easysimbl'
cask 'licecap'
cask 'flux'
cask 'karabiner'
cask 'seil'
cask 'cleanarchiver'

# ライブラリ
cask 'flash'
cask 'java'

# 仮想環境・開発ツール
cask 'sourcetree'
cask 'github-desktop'
cask 'imageoptim'
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
cask 'sequel-pro'
cask 'docker'

# デザイン
cask 'slicy'
cask 'sketch-tool'
cask 'sketch-toolbox'

# マルチメディア
cask 'vlc'
cask 'air-video-server-hd'
cask 'xld'
cask 'makemkv'
cask 'handbrake'
cask 'amazon-music'
cask 'kindle'
cask 'vox'

# コミュニケーション
cask 'skype'
cask 'google-hangouts'

# QuickLookプラグイン
cask 'qlstephen'
cask 'qlmarkdown'
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'brushviewql'

# MacAppStore
mas 'Name Mangler', id: 402434720
mas 'LINE', id: 539883307
mas 'FreeMan', id: 510934532
mas 'Keynote', id: 409183694
mas 'CloudApp', id: 417602904
mas 'Twitter', id: 409789998
mas 'GarageBand', id: 682658836
mas 'Pixelmator', id: 407963104
mas 'DaisyDisk', id: 411643860
mas '1Password', id: 443987910
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot', id: 557168941
mas 'Transmit', id: 403388562
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'Minutes', id: 406827163
mas 'iMovie', id: 408981434
mas 'Disk Diag', id: 672206759
mas 'Caffeine', id: 411246225
mas 'Bear', id: 1091189122
mas 'Slack', id: 803453959
mas 'Affinity Designer', id: 824171161
mas 'CotEditor', id: 1024640650