# リポジトリ(フォーミュラ)の追加
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'caskroom/homebrew-cask'
tap 'caskroom/homebrew-versions'
tap 'josegonzalez/homebrew-php'


# パッケージのインストール
# brew-cask
brew 'brew-cask'

# Git・シェル
brew 'git'
brew 'git-flow'
brew 'zsh'
brew 'zsh-completions'

# パッケージマネージャ
brew 'nodebrew'
brew 'rbenv'
brew 'ruby-build'
brew 'direnv'

# ライブラリ
brew 'autoconf'
brew 'ffmpeg'
brew 'libiconv'
brew 'libxml2'
brew 'libxslt'
brew 'openssl'
# brew 'openssh', args: ['with-brewed-openssl', 'with-keychain-support']
brew 'pkg-config'
brew 'imagemagick'
brew 'sox'

# ミドルウェア
brew 'mysql'
brew 'php55'
brew 'wp-cli'
brew 'docker'
brew 'boot2docker'

# Vim
brew 'vim', args: ['with-lua']

# その他
brew 'tree'


# MacAppのインストール
# ブラウザ
cask 'google-chrome'
cask 'firefox-ja'
cask 'opera'
# cask 'vivaldi'

# ターミナルエミュレータ・エディタ
cask 'iterm2'
cask 'coteditor'
cask 'sublime-text3'
cask 'mou'
cask 'macdown'
cask 'sourcetree'
cask 'github'
cask 'atom'

# ユーティリティ
cask 'google-japanese-ime'
cask 'alfred'
cask 'appcleaner'
cask 'dropbox'
cask 'google-drive'
cask 'bettertouchtool'
cask 'steermouse'
cask 'transmission'
cask 'utorrent'
cask 'easysimbl'
cask 'licecap'
cask 'trim-enabler'
cask 'isyncr'
cask 'android-file-transfer'
cask 'flux'
cask 'near-lock'
cask 'box-sync'
cask 'karabiner'
cask 'seil'

# 仮想環境・開発ツール
cask 'imageoptim'
cask 'codekit'
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
cask 'sequel-pro'
cask 'xbench'
cask 'vmware-fusion'
cask 'heroku-toolbelt'

# デザイン
cask 'adobe-creative-cloud'
cask 'slicy'
cask 'ember'
cask 'blender'
cask 'sketch-toolbox'
cask 'framer-studio'
cask 'pixate'
cask 'pixelapse'

# マルチメディア
cask 'vlc'
cask 'air-video-server-hd'
cask 'airfoil'
cask 'xld'
cask 'makemkv'
cask 'handbrake'

# コミュニケーション
cask 'skype'
cask 'google-hangouts'

# QuickLookプラグイン
cask 'qlstephen'
cask 'qlmarkdown'
cask 'betterzipql'
cask 'qlcolorcode'
