cask_args appdir: '/Applications'


########## Tap Formula ##########
tap 'heroku/brew'


########## パッケージのインストール ##########
# Git・シェル
brew 'git'
brew 'git-lfs'
brew 'fish'
brew 'fzf'

# パッケージマネージャ
brew 'mas'
brew 'nodenv'
brew 'rbenv'
brew 'pyenv'
brew 'goenv'
brew 'direnv'
brew 'yarn'

# ライブラリ
brew 'openssl'
brew 'libpng'
brew 'fontforge'

# 開発ツール
brew 'firebase-cli'
brew 'heroku'

# その他
brew 'vim'
brew 'tree'


########## MacAppのインストール ##########
# ユーティリティ
cask 'appcleaner'
cask 'bettertouchtool'
cask 'cursorsense'
cask 'licecap'
cask 'keepingyouawake'
cask 'karabiner-elements'
cask 'bartender'
cask 'alfred'
cask 'contexts'
cask 'google-japanese-ime'
cask 'haptic-touch-bar'
cask '1password'
cask 'cmd-eikana'
cask 'xquartz'

# ブラウザ
cask 'google-chrome'
cask 'firefox'
cask 'opera'
cask 'vivaldi'

# クラウドサービス
cask 'dropbox'
cask 'google-backup-and-sync'

# ターミナルエミュレータ・仮想環境・開発ツール
cask 'hyper'
cask 'sourcetree'
cask 'virtualbox'
cask 'docker'
cask 'genymotion'
cask 'google-cloud-sdk'
cask 'sequel-pro'

# エディタ・IDE
cask 'visual-studio-code'
cask 'processing'
cask 'android-studio'
cask 'unity-hub'
cask 'notion'

# デザイン
cask 'adobe-creative-cloud'
cask 'sketch'
cask 'abstract'
cask 'zeplin'
cask 'figma'
cask 'imageoptim'
cask 'fontforge'

# マルチメディア
cask 'vlc'
cask 'air-video-server-hd'
cask 'xld'
cask 'android-file-transfer'
cask 'audirvana'
cask 'spotify'

# コミュニケーション
cask 'skype'
cask 'discord'
cask 'google-hangouts'

# QuickLookプラグイン
cask 'qlstephen'
cask 'qlmarkdown'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'betterzip'


########## MacAppStoreのアプリをインストール ##########
mas 'Name Mangler', id: 402434720
mas 'LINE', id: 539883307
mas 'CloudApp', id: 417602904
mas 'Keynote', id: 409183694
mas 'Unsplash Wallpapers', id: 1284863847
mas 'Magnet', id: 441258766
mas 'The Unarchiver', id: 425424353
mas 'Pixelmator', id: 407963104
mas 'DaisyDisk', id: 411643860
mas 'Fantastical 2', id: 975937182
mas 'Numbers', id: 409203825
mas 'Affinity Photo', id: 824183456
mas 'Pages', id: 409201541
mas 'QuickShade', id: 931571202
mas 'Bear', id: 1091189122
mas 'Transmit', id: 403388562
mas 'CotEditor', id: 1024640650
mas 'Xcode', id: 497799835
mas 'Spark', id: 1176895641
mas 'EdgeView 2', id: 1206246482
mas 'Affinity Designer', id: 824171161
mas 'Slack', id: 803453959
mas 'Disk Diag', id: 672206759
mas 'Tag', id: 506232966
